package com.sist.io;
/*
 *   1. 프로그램 
 *     => 흐름 => 클릭 => 어떤 화면 card.show() => <a href="">
 *     => 문법 : 자바의 기본
 *     => 조립 : 조립 방식 
 *    ------------- 소스코딩을 숙달 
 *   2. 회화 => 문법 (x)
 *      ------------- 
 *      
 *      
 *      => 객체 생성자
 *      new 사용하면 결합성이 높은 프로그램이다 => 가급적이면 new를 사용하지 않는다 
 *      new 객체생성 
 *      
 *      new없이 객체 생성이 가능
 *      | 리플렉션 => 스프링
 *      | 메모리 누수 현상 방지 => 패턴(싱글턴)
 *      
 *      => 디자인 패턴
 *         GOF 패턴 : 23가지 => 8가지
 *         싱글턴 : 데이터베이스 => Connection => XE(50)
 *         클래스 여러 개 관리 => 팩토리 패턴
 *         자동 형변환 => 어댑터 패턴
 *         ---------------------------------------
 *         MV 패턴
 *         데이터 관리 + 화면 UI
 *         -----------------
 *            | Back   | Front
 *         
 *         MVC 패턴
 *         -------
 *           | 데이터 관리  화면 UI
 *                |        |
 *                ----------
 *                  | Controller => Model + View + Controller 
 *                  
 *             
 */
public class 라이브러리_01 {
	public static void main(String[] args) {
		
	}
}
